In [15]:
import pandas as pd
import openpyxl

In [12]:
df = pd.read_csv("stock_data.csv",skiprows= 1, na_values= {"eps":['not available'],"revenue":[-1]})

In [13]:
df.head()

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65           n.a.
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [14]:
df.to_csv('Stock1.csv')

In [22]:
def stand_cur(curr):
    if curr == '$$' or "Dollars":
        return "USD"
    return curr

movies_df = pd.read_excel("movies_db.xlsx", "financials", converters={'currency' : stand_cur})

In [23]:
movies_df.head()

   movie_id  budget  revenue      unit currency
0       101     1.0     12.5  Billions      USD
1       102   200.0    954.8  Millions      USD
2       103   165.0    644.8  Millions      USD
3       104   180.0    854.0  Millions      USD
4       105   250.0    670.0  Millions      USD

In [28]:
movies_df.isnull().sum()

movie_id    0
budget      0
revenue     0
unit        0
currency    0
dtype: int64

In [29]:
movies_df.fillna('revenue', inplace = True)